
Функция ОстатокПоСчету(ТекСчет) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДенегПоСчетамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеДенегПоСчетам.Остатки(, Счет = &ТекСчет) КАК ДвижениеДенегПоСчетамОстатки";
	
	Запрос.УстановитьПараметр("ТекСчет", ТекСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция СуммаВзаиморасчетов(Контакт) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ВзаиморасчетыОстатки.ПроцентыОстаток КАК ПроцентыОстаток
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(, Контакт = &Контакт) КАК ВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток + ВыборкаДетальныеЗаписи.ПроцентыОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция СуммаДоходовКРаспределению(КонДатаЗапроса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДенегПоСчетамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеДенегПоСчетам.Остатки(&КонДатаЗапроса, ) КАК ДвижениеДенегПоСчетамОстатки";
	
	Запрос.УстановитьПараметр("КонДатаЗапроса", КонДатаЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ВсегоРаспределено(Статья = Неопределено, ТекПериод = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланРасходов.Сумма КАК Сумма,
		|	ПланРасходов.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПланРасходов КАК ПланРасходов
		|ГДЕ
		|	ПланРасходов.Период МЕЖДУ &НачДата И &КонДата
		|	И 1 = 1
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Период";
	
	Запрос.УстановитьПараметр("КонДата", КонецМесяца(ТекПериод));
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(ТекПериод));
	Если Статья <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ПланРасходов.Статья В ИЕРАРХИИ(&Статья)");
		Запрос.УстановитьПараметр("Статья", Статья);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Функция РасходПоСтатье(Статья, ТекПериод) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДенегПоСчетамОстаткиИОбороты.СуммаРасход КАК СуммаРасход
		|ИЗ
		|	РегистрНакопления.ДвижениеДенегПоСчетам.ОстаткиИОбороты(&НачДата, &КонДата, Авто, , Статья В ИЕРАРХИИ(&Статья)) КАК ДвижениеДенегПоСчетамОстаткиИОбороты
		|ГДЕ
		|	1 = 1";
	
	Запрос.УстановитьПараметр("КонДата", КонецМесяца(ТекПериод));
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(ТекПериод));
	Запрос.УстановитьПараметр("Статья", Статья);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаРасход;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции // ЗатратПоСтатье()
 
Функция НепотраченныйОстатокПрошлогоПериода(Статья = Неопределено, ТекПериод = Неопределено) Экспорт
	
	Если Статья = Неопределено Тогда
		ПланПрошлогоМес = ВсегоРаспределено(, ДобавитьМесяц(ТекПериод, -1));
		ФактПрошлогоМес = РасходПоСтатье(, ДобавитьМесяц(ТекПериод, -1));
	Иначе	
		ПланПрошлогоМес = ВсегоРаспределено(Статья, ДобавитьМесяц(ТекПериод, -1));
		ФактПрошлогоМес = РасходПоСтатье(Статья, ДобавитьМесяц(ТекПериод, -1));
	КонецЕсли; 
	
	Возврат Окр(ПланПрошлогоМес - ФактПрошлогоМес, 2);
	
КонецФункции