
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДвижениеДенегПоСчетам Приход
	Движения.ДвижениеДенегПоСчетам.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеОперации Из ДанныеОперации Цикл
		Движение = Движения.ДвижениеДенегПоСчетам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Счет = Счет;
		Движение.Статья = ТекСтрокаДанныеОперации.Статья;
		Движение.Сумма = ТекСтрокаДанныеОперации.Сумма;
	КонецЦикла;

	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеОперации Из ДанныеОперации Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контакт = ТекСтрокаДанныеОперации.Контакт;
		Движение.Статья = ТекСтрокаДанныеОперации.Статья;
		Движение.Сумма = ТекСтрокаДанныеОперации.Сумма;
		Движение.Счет = Счет;
	КонецЦикла;

КонецПроцедуры
